import type { JSX, SVGProps } from 'react';

export function ChevronRightIcon(props: SVGProps<SVGSVGElement>): JSX.Element {
  return (
    <svg
      width="27"
      height="26"
      viewBox="0 0 27 26"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      aria-labelledby="chevronRightIconTitle"
      {...props}
    >
      <title id="chevronRightIconTitle">오른쪽 쉐브론 아이콘</title>
      <path
        d="M13.9698 13L9.74476 8.77503C9.54615 8.57642 9.44685 8.32364 9.44685 8.0167C9.44685 7.70975 9.54615 7.45698 9.74476 7.25837C9.94337 7.05975 10.1962 6.96045 10.5031 6.96045C10.81 6.96045 11.0628 7.05975 11.2614 7.25837L16.2448 12.2417C16.3531 12.35 16.4298 12.4674 16.475 12.5938C16.5201 12.7202 16.5427 12.8556 16.5427 13C16.5427 13.1445 16.5201 13.2799 16.475 13.4063C16.4298 13.5327 16.3531 13.65 16.2448 13.7584L11.2614 18.7417C11.0628 18.9403 10.81 19.0396 10.5031 19.0396C10.1962 19.0396 9.94337 18.9403 9.74476 18.7417C9.54615 18.5431 9.44685 18.2903 9.44685 17.9834C9.44685 17.6764 9.54615 17.4236 9.74476 17.225L13.9698 13Z"
        fill="#6D7183" // 기본 색상 설정, 필요시 props로 오버라이드 가능
      />
    </svg>
  );
}
